<?php

namespace App\Models;

require_once 'app/core/data_validator.php';

use App\Core\DataValidator;

final class TestModel {

    /*
     * @param string[] $user_answers
     * @param string[] $lim_errs
     * @param string[] $series_errs
     * @param string[] $hard_errs
     */
    private function __construct(
        public array $user_answers = [],
        public array $lim_errs    = [],
        public array $series_errs = [],
        public array $hard_errs   = [],
    ) { }

    /*
     * @param string[] $user_answers
     */
    public static function from(array $user_answers): self {
        return new self($user_answers);
    }

    public function check_test(): void {
        $this->lim_errs =
            DataValidator::for($this->user_answers['lim'])
            ->with_rules([
                'is_int'   => DataValidator::is_integer(...),
                'solution' => fn($d) => (int)$d == 5])
            ->with_dependences([
                'solution' => ['is_int']])
            ->collect_errors();

        $this->series_errs =
            DataValidator::for($this->user_answers['series'])
            ->with_rules([
                'solution' => fn($d) => $d === 'answ2'])
            ->collect_errors();

        $this->hard_errs =
            DataValidator::for($this->user_answers['hard_one'])
            ->with_rules([
                'solution' => fn($d) => $d !== '4'])
            ->collect_errors();
    }

    public function has_errors(): bool {
        return $this->has_lim_errors()
            || $this->has_series_errors()
            || $this->has_hard_errors();
    }

    public function has_lim_errors(): bool {
        return count($this->lim_errs) != 0;
    }

    public function has_series_errors(): bool {
        return count($this->series_errs) != 0;
    }

    public function has_hard_errors(): bool {
        return count($this->hard_errs) != 0;
    }

    /*
    * @return iterable<string>
    */
    public function get_lim_messeges(): iterable {
        return DataValidator::map_error_messeges($this->lim_errs, [
            'is_empty' => 'Ну и что я должен с этим делать? Нужно вписать что-нибудь, идиот.',
            'is_int'   => "Нужно целое число, а получено {$this->user_answers['lim']}, идиот.",
            'solution' => "Правильный ответ - 5, а получено {$this->user_answers['lim']}, идиот. Это БесПРЕДЕЛ!",
        ]);
    }

    /*
    * @return iterable<string>
    */
    public function get_series_messeges(): iterable {
        return DataValidator::map_error_messeges($this->series_errs, [
            'is_empty' => 'Ну и что я должен с этим делать? Нужно вписать что-нибудь, идиот.',
            'solution' => "Правильный ответ - 2). Получено {$this->user_answers['series']}, идиот. Ольшанская уже выехала за тобой."
        ]);
    }

    /*
    * @return iterable<string>
    */
    public function get_hard_messeges(): iterable {
        return DataValidator::map_error_messeges($this->hard_errs, [
            'is_empty' => 'Ну и что я должен с этим делать? Нужно вписать что-нибудь, идиот.',
            'solution' => <<<TEXT
            Правильный ответ -
            [Fri Feb  6 15:20:09 2026] [::1]:40566 [500]: POST /study/test - Uncaught Error: Unknown named parameter х̴̧̧̡̢̛̦̞̥̮̯̣̹̬̖̳̫̲̤̠̦̩͇̩̟̬͖̠̱̙̜͙̜̰̫͙̘̪̭̬̥͚̲̹͖͙͕̬͕̟̀̇ͬ̇ͫͧͫͤͬͦ̈́̈́ͫͥͩ̐͛̒̿̀ͥͨͨ̐͒̉̊̄ͭͦ̀͛̒͌̓̋͂̇ͧͬͮ̓̄ͨ̽͛͂̐̃ͮ̚͘̕͜͢͢͢͢͢͟͟͠͞͡͞͠͝͠͝ͅ__̢̰͖ͦ̈ͥ̚̕͟_̷̨̢̡̨̖͇͉̬̯͇̗̘̞̫ͫ̍ͣ̾̑ͤͤͩ̎̽̎̿̿̈̀ͨ̄͛͗̿̀ͮ͘͘̚ͅ_̵̷̷̵̷̴̶̸̵̸̸̸̨̢̢̢̡̨̨̛̗̣̫͇̘̬͈̯̞͓̤͈̦̘̗̥̺̙͔̪̫̪̳͔̻̻̩͖̲̹̬̱̭̥͈̤̭̰̹̣̻̫͈̖̮̯͓̤͚͉͎͕̺̰̼̠̺̥͈̹͎̪̼̫͙̖̮̜̫̹͔̼͙̤̲͕͙̖̗̣̮̤̪̖̞̜̜͖̼͉̙̺̰̫̫̮̦̠̱̘̪͎̟̬̖̝̳͉̲͇̜̬̘͗̈́̏͆̋͛̏̅̌́̎ͤ̓ͥ͒́̏̍͐̉̓̽͐̃̀́ͥͨ͊̓̎ͯ̐̿̏̊͂̆̌̽͒̿̌͂͑͌ͤͨ͋̂ͤ̍ͭ̄́̅͑̿ͥ͊͒́ͨ̽͊̋̃ͩ̂ͯ̉ͮ̔̔̑ͧͧ́̏́̅͑̏͐͂̉̆͋͐̑̄̀̈̓ͫͤ̒ͭͯ̓̄̈́͑̿͛̊̓ͪ̊̆ͬͣ̉̽̽ͥ͐́̋ͭ̊ͫͧ̐ͬ͛͌ͧ̓͆ͧ̔̒͂̒͗̑͗ͫ̀ͮͮ̇̆̐͂̓ͪ́ͭ̈̚͘͘̕͘͘̚̕̚͘̕͟͟͢͜͟͟͢͜͜͢͢͢͠͡͠͠͝͝͞͝͠ͅу̴̴̴̶̵̶̧̡̢̨̡̡̛̛̻̲̬͓͎̥̹̜͔̱͓̘̗͎̙͓̺̦̲̖͉̻̮̲̫͓̣̗̝̦͇̻̫̹̞̮̗̣̱̞̖̮̘͛̊ͥ̈́̅̒̓ͫ̃ͫ̌̐͌ͫͦ̇͊̊̍̓͛̆͒ͥ̿ͥ͒ͪ̏́ͣ̾̑̏̉ͧͧ͒ͫ̿́͛ͯ̊̕̚̕͘͟͜͟͡͠л̛͔̙̤̮̯̣͖͔̲͖̹̪͓̑ͣ̾̂̃̉̅̈ͮ́̌̇͋ͩ̄̍̇̍͜͝͠͠͞_̢̡̢̙̪̲̻͖̫̣̲͚̙̼̌̉̃͆̂̽́͊ͫ͌̉̌̾̔͘͜͡͝_̷̷̵̷̢̛͙̳̤̳̼͔͇̺̗͉̦̖̫͖̮̗̼̄̀̀̊̅ͤ̈̃̉̒ͤ́ͩ̀͌ͭ͋ͩ̈̎̐͂̽̒͑̕̕͢͝͝͡ͅ_̵̲̯͍͇͒̆ͪ̾ͪ͞ͅ_̵̷̶̸̴̶̵̞͈͙̮̙̞̙̬͕̪̠̫͚̝̐ͤͫ̓ͣ́̆ͭͤ͗ͬ̑͊́ͪ̇̽ͭͬͤ̑̈́̑ͫ͒ͤ͠͝_̶̴̷̶̷̶̸̴̢̧̨̡̛̘̙͍͕͕̮̬̮̜͖͍̼͙̝̪͇̖͙͖̫̝̪͉͚͇̲̘̬̮͙̺͈̻̣̬̦̹̞͚̱͇̤̳̩̞̮̱͇̟̫͎͉̳͓̙͉͖͈̯̮̣̞͍͛̀͂͐ͩͨͫ͗̉ͭ͆̈̒̊ͥͭ̎̔̈͑̎̌͛̇ͮ̍̾ͥͫͫ̽̊͒̒͋̄ͨ̓͆̔̈́͛̊́̏ͤͥͨ͆͊̓̌͆ͯ̇ͭ̾͒̇̂͐̈́̌̏͑ͥ̉ͪ̎̅ͨ͊͋ͬ͊͛̏ͣ͂̇ͨͬͬ̽̈ͤ͐̌ͨͬͩ̀͋ͬͨ́̋̚̕̕̚̕͜͜͢͢͞͠͞͞͞͠͝͠͡͞͡͡_̴̷̢̡̛͎͈̗̦̖̥͈̹͉̻̜̥̦̞̘͈̝̺̱̜̪͚̞̫͑̍̿̄ͧ͋̏ͤ̋ͭ̈̔̇ͮͦ͐̆ͧ̌̓ͬ̔̍̑́̾̔̃̋ͧͮ́̒̑͛͘̚̚͞͝͡͞͞͠_̧̳͖͚̜̞̅ͤ͆͗ͪ͌ͫͪͫ͗_̶̶̴̨̡̨̨͈̬͎͎͉̩͚̖̖̳̰̮̭͙͍̼̭̰̙̤̰͆͂̂͂ͥ̈̑̄ͯ̉̈ͥ̀̋̒͐ͪ́̕̚͘͟͝͝͡͝͡͡ͅ_̸̵̶̸̸̸̷̵̵̷̢̨̧̨̨̨̧̰̻̞͇͉̩̠̲͕̜͍͎̳̝̞̱̼̳̻̹̪͕̩̠̱̘͇̫͔̠̭̙͍͖̰̲͈̦͔͍͍ͤ̃́̃ͮͨ͆ͩͥ̅̔ͥ͂ͩͯ̐͒̋̆ͧͮ͌͛ͩ̊̔̏̀͐͐͋͛̋̒̈́ͥ̅̅͌̐͐̍ͨ͑̽̅̆̒̒͊̋ͮ̽ͮ̾ͬ́͐̚̕͘͢͜͜͜͟͢͟͡͠͝͡͞͞͡͡ͅ_̡͐̓̎_̴̷̷̶̷̴̡̨̧̨̨̨̪͕̟̩͇̬͎̰̮̤̣̻̺͎̣̟̳͙̯̣̯̝̦̼ͥ͐̈́ͩͨ͐̈ͯ̋̈́ͮ̉̍̂ͯ̏͋ͭͩ͌̑̚̚̚̚͜͟͟͜͟͜͠͝ͅͅи̶̡̧̞̪͚̳̘͙͇̟̟͍̻̼̹̳̻̥͇̯̯͓ͣ͌́͒͐ͧ̍̆́̿ͫͫ̌̑̾ͣ̋̅̓̀͗̉̈́ͩ̅̕̚̚͘͢͟͟͢͜͝͞͠_̨͕̭̝ͩͮ̆ͫ_̮̜͇̘̭̥̬͓̣̺̩̝̤̳̗̭͇̭̟̠͇͙͇͖̘̟ͫ̂̈́ͩ̎ͣͩ́̿̓̃͆́̀̔͋͛̾ͧ̀̋̀̓ͪ͒͊̈͋͂ͨ̂ͪ͘̕͢͢͠_̸̴̵̶̷̴̸̷̷̵̸̷̶̴̶̶̵̷̶̵̨̢̨̧̧̢̨̡̧̡̧̨̧̨̛̛̖̪͚̖̩̥͚̭̩̙̻̗̣̞̦̼̥̠̲̖͇͎̲̦̫͖̝̟͕͍̰̭̗̤̩̱͕̙̼͉̼̘̳͔̟̖̠͓͈̯̜̩̘̠̣͙͙͔͔̼̺̟̥̙͕͉̼̺̹̟͎͓̻̦͎̜͉̙̠̲̝̭̰̘̮̘̖̮̫̬̺̥̫̯͍̞̤͓̗͚̣͕̮̰͚͚̭̹̦̜̪̫͈͍̙͍͙͇͇̳͉̺͔̘͍̟͖̦̣̤̫́̐̍ͫ̀̓̿ͤͬ̎͊̽̅ͦ́̃ͬ͛̍̂̇ͪ͂̽͗̓ͤ͋͐ͪ̄͗͐̆ͦ̆̆̓̏ͦ̾̍ͥ̽̒ͬͧ̀ͣ͐͌ͩ́̎ͨͮͤ̆͊͋̔ͤ̊͒̊͑̀̎̑̅͗ͬ̿̍̇͆͊̏ͦͧ̇͐̾͗̒̓̀͂͆͋̎̀ͣ̈ͤ̽̿̏́ͯ̒͗ͯ̔̽̅̈́̿ͯͨ̓ͨ́̓̈́͑ͣ̄ͦͤͤ̃̇̋́ͣ͋͗͑̐ͯ́͆̈́̃͐̒ͭ͒̏ͩͮ̎̎͑̔̈̎̍̔̈̄͂ͧͬ̅̍̇͋̀̍́ͩ̽͌͊̑ͪ̅ͬͮ̿͐͐ͪ̑̊̀̔ͤͤ̀̅ͨ͗͊̈̋͂ͮ̅ͬ̌͆͗̚̕͘͘͘̚͘̚̕͘͘͜͟͢͟͟͟͜͢͢͞͠͞͠͠͡͡͡͞͡͝ͅ с̶̷̵̵̴̶̵̸̨̡̨̨̧̛̳̖͎̳̤̘͓̼̤͇̞̻͔̫̼̞̱͕͈̲͈̮͔̖̠͖̩̥̖̻͈̯̣̥̬͍̝͓̼̣̣͍̙̦̫̆̍̈́̓̋ͬ͆ͭ̅̑̏̽̏͗ͦͫ̒̀̏̈̍̓̓̄̔̈́ͭ̽̎̄̃ͪͤ͆͊̈̓̾̿̒ͨ̐̃̾̏͗̈́͊̑̄͑͆̈́ͤͧ̂̓̈́̄ͮͤͬ͌̉͑ͫ̈́̆́̐̈́̈̄͛̏́̆ͫ̓͘̕͘͟͟͢͢͢͜͠͞͡͡͝ͅ_̵̢̡̧̛͇̻̮̜̝͖̱̠̹̙͔̼̥̼̥͍͈ͬ́̈̀ͥ̓̔̓͌ͤ̀ͩ̆̒̌ͫ́ͩͩ̐ͭ̉͑ͦ̈́ͪ̾̈͘͟͟͞͞_̴̴̪̹̹̳̬͈͓̤̜͓̤ͬ́ͩ̏̄ͩ̋͛͑̀̾͊ͥ̽ͦ̚͘̕͟͠͡͝͝ͅ_̨͚͖͓̘͕̻̗͖̠̰̟͕̩͔̘̤̑͑̂͒̽ͭͩ͗̂́ͥ̄ͩ̃́͆̿̓̓̓̀̃ͤͮ̕͜͝͞_̡̢̢̛̰͎̫̣̹̗͖̞̬̩͔͉̍ͯ̏̂ͥ̾̍͊̎̂ͯ͋̽͂ͫͭͥͭͧ͐ͯ̐͘͢͟͝͝͝͞ͅͅ_̸̵̴̴̢̧̡̨̪̹̯̞̩͕̗̟̫̗̟̳̣͓͕̳̪͚͈̲̩͉ͫ͐̉ͦͤ͗̈ͮ̄͊́̓̿̋̔̾̉ͪ̈́ͧͥ̎̄͑̓̋̌́̚̕͟_̵̴̸̶̷̧̢̛̗͇͔̱̝̼̗̻͔̠̼̤̪̞̮̩͎ͤ̊̇̄ͦ̊ͣ̈̈ͣ̅̅̂̌̓͂͋̾́̾̐̋̚͘͘͟͟͢͠͝м̥̠̯͇̙͍̺̊̋̊ͤ̃̌̃̕͜͜͡о̶̸̷̶̷̶̢̡̛̦͈̦̰͕̲͖̥͍̘̫͕͓̟̪̪͓͖͕̯̥̣͎̳͈̲̣̬̩͉̲͈͓̰͈̮͎̙̒̊̏ͯͪ͂̌̽̈́̇ͭͯ͐̍̀́̀̿̀͂̈̏͒͋̅̓͌͆͊ͤ͆̅̔̏͌̆̏ͫ̑͗̆́͆̑͂̈͑ͬͤ͢͟͡͞͡͡͡ͅ_̵̢̡̱̯̦͎͎̮͉͚̥̯̤͓ͫͩ̑ͦ͊̎̎͂̃͋_̷̸̴̵̡̨̨̧̢̢̡̳͕̺̝̜̥̮̣̫̖̱̹̥͓̯̮͎̥͎͎͖͕̫̳̰̬̜̦̮͙̩̜͙̼̇ͮ̄̓͌̋̅̅͗͊̓ͥ̅ͯ̽ͥ́ͮ̉̒ͣ͐̀ͧ̎̿ͧ͌͋ͥ͒̎͛͒̿̑̀͌́̀̉ͣ̀̄̕͘͡͝ͅ_̸̴̵̵̶̢̡̧̨̢̡̧̜̼͙̺̣̙̳͙͙̱̥̦̣͓͓̹̠͎͇͙̠̭͓̦̪̜̟̙̪̰͇̜͉̩̼̙̫̗̞͎̫̱̞̪̰͔̦̼̠̥̯̺͍͍̟̪̫͆̏ͫ͗̌͊́ͨ̾͐̃ͪ̿͗̅̉̒̇ͩ͑̉̌ͩ̌̅ͭ̓ͣ̐̈ͮ̿ͦͧ́͗̌ͭ͊͋̊̂͋ͮ́͛̄͒ͪͩͫ̈̇ͬͣ̊͋̽̾͒̓̎̇̇̚͘̕̚͘͟͜͢͟͠͡͝ͅͅͅ_̸̵̷̸̵̴̶̵̸̵̸̢̢̡̧̨̧̡̢̛̛̺̝̖̱̳͎̞̟͍̻͔̰̟͍̜̭̖̥̳̟̱͈̲̦͎̞̱̤̭̝͇̳̳̰͙͇̦̘͍̯̮̘̲̳̻͉̺̱̰͈͓̦̖͎̞̫̖̪͉͚̲̜̟ͣ̂̃̐ͭ̏͂͑ͦ̾̅̐̌͗̊͆̆̅̒ͥ̓͌̽̀ͨͯͩͧ̌̋̒ͬͤ̔͗͆̔͐̏͌͑̋́̓ͩ̈̀̐̽̏͑̎̊̿̑̓ͧ̏͐̊̏̀̐̒̏̄̔͂̓̎̏͑͐̈̏̓ͪ͐ͫ̿̋̿̆͑̊͛͐̒͘͘̕͘̕͢͟͟͟͜͢͟͠͠͡͡͞ͅͅͅ_̸̴̶̷̸̵̡̛̪͉͖̲͉̭̪͇̮̣̭͈͇̫̮̱̭͙̩̖̘͙͉̄̒͛͗̒̍́̂̄ͮ́̍̉ͫ͊̒͟͢͢͝_̶̢̡̨̛̬̜̖̫̬̱̣̗̫͎̬̜̹͉͑̄̎͌̑͑ͧ̉ͣ̽ͦ̌̎͜͜͟͝͞_̷̸̴̵̷̶̸̷̴̢̨̨͎͉̠͎̤̼̱͚̹̼̖̯̘̼͍̠̫̗̬̭̮͖̮̹̰͔͍̠̝̩̺̤͈̱͖͉̹̹̝̥̹ͩ̄͂̅ͦ́ͭ͐ͪ̎̓͆̍̈͐̃̐ͫ́̀̌̆ͯͫ̐̋͌̓͋͐̇̀ͤ̏͒̉͑ͥ͋̂͐̾͊̂͂́̌ͮͯ͑ͦ̏̋ͫ̇͋ͪ̄͌̾̚͘̕͘͘͝͠͡ͅ_̶̴̸̸̴̶̴̷̶̧̢̡̧̢̢̢͚͕̹̙̝̭̺̮͖̥̮̙̣͔͖̙̩̟̙͍̫͔̺̥̭͇͇̜̮̙̟ͧ͊̊͒̾ͨͮ́ͨ͌̑ͯͧ̒̌ͣ͒̂ͧ͌ͭ̑̇̽̃ͥ̎͊͂ͯ͊ͥͫ̌̊̌͆ͭͣ͛ͨ̃̐̌̃͘͘͘͜͡͡͞_̶̹͔͕̮͖̤̮̣̖͕͖̺̼̪̾ͬ̓ͣ͛ͬ̓͘_̵̸̣̥̯͖̲̤̟̞̻͙͖̪̯̺̽͐̽ͫ̍̀ͩ̑ͬ͐̇ͭͦ͐̌͂̏ͦ͐͐̽́́̏̋̍̃̅̓̽̕̕̚͟͞т̴̨̨̡̧̛̬̮̪̪̪̺͕̲̬͉̣̥̘̬͔̓̒̿́̀̒͆̓̆͆ͩͧ̍͊̏́̆ͤ̍̑̈́̂̏́́͆̓̚͜͢͢͢͢͠͝͝р̸̶̵̵̴̷̷̴̴̶̸̷̸̧̧̢̧̛̛̜̼̖̺̞̹̜̙̦̻̩̗͉͔͖̬͔̥̠͎̮̟̱̻͙͔̬͔̥̙̬̞̗͚̜̺̫̩̺̼̻̩̩͇̯͎͖͚͉̞̥͕͉̗͙͔̼̳͎̗̜̞͈͖̦͕͉͚̫͕̿͒̆ͪ̋̎̎̑̓̍̇ͨͥͩ̀͑̎ͨͨ͊̽́̋ͨ̀ͮ̓ͥ̅̇̅͌̀̀͑̉̽ͭ͛ͬ̓̏͛̑́ͨ̃̈́̿̊ͫ͌ͭͧ͐̇̈́̋̿͗̓͑̏͛̌̏ͫ̑̾̈́͂͒̂̈̐͑̃̐ͦ̿͌̽͘͘̕͘͜͟͟͟͟͜͡͝͡ͅͅи̷̶̵̸̸̶̶̸̶̸̢̧̢̠̘̟͉͓̳͖͕̗̹̗̮̝̙̗͔̭̥̰̤̺̘̙̰̯͙̱̖̯̻̤̗̣̼̗̺͍̝̮̻̫̣͇̝̘̫͕͚̦̞̭̟̩̽̅ͧ̋ͮ͗͛̋̂͑̔̀̽̌͆̔͑ͥͮ͂ͥͬͬ̍̅͆ͭ͌̀ͥ̽̄̎ͩͨ̀ͮ̉͊̈͂̄ͯ̄̓͋̏̃͒ͧͫͯ̆̅ͤ̈̌ͭ̓ͮ̿̆͆̚͘͜͢͢͞͞͝͝͞ͅ_̷̨̛͕̭̙̭̫̗̟̭̱̖̜̟͔͕̖̼̬̐̄̒ͧ̍̀̀ͮ̈̔ͭ͛͋͆͛͐͊ͭ͜_̶̴̷̴̴̶̧̡̛̛̛̛̙̞͇͖͔͔͉͔̰͇͈̠̩̳̲̹̞͖̘͙͙̯̼͓͎̲̲͚̱͖̬̬̲̞̭̱͇̘̣̣̞̟̲͖͕̮̘͕̯͙̗͎̘͕͙̻̞̻̻̻̮͖̘͚̬͇̝́ͬ̆̋́̆̾̒ͯͪͥ̎̀͊̂̈ͪͪ̋̄͌̀̐ͯ̀̈͌̇̈ͧ̂̀̔ͥ̀ͮ̓̾̎͑ͩ͊̊ͣ͌ͫ̎͆̉͛ͣͪ̓ͬͤ̔͐͛̓ͪ̿͌̅̔͘̚͘͘͘͘̕͜͢͟͜͜͞͝͡͠ͅͅ_̸̸̸̴̵̸̶̢̡̢̢̢̢̡̨̛̛̤̣͎̝͔̬̤̱̦͈̘̬̞̱̘̳͇̩͚͕̦̤̹̤̤̱͚̻̯̹̭͇̜̘̟̺̫̜̩͖̣̖̱͉͉̱͓̘̩̼͚͙͎̭̹̭̟̝͙ͮͧ́ͣ̈̈̍͆ͪͤ̒ͤ̅̐ͣ͗̈ͤ̐͑̊̀̓ͭ̆̐́̔̒͑͛̊ͬ̀ͮͬͯ̓̎ͬ͒ͫ̽̐͛̇͊ͨ̑̆͋ͧ͋͛͊ͪͦͦ͋̄̈́͒̑̓ͮ̈́̐ͦ̈́̓̂͛ͧ͘̕͘̕͘̚͜͜͜͢͜͞͠͡͠͠͠͝͠͞͡͠ͅͅ_̧̻̹͎̹͆͌̓ͥ͐͆̂̌ͩ̽͟͞_̷̬̪̹̩̇ͤͯ̾͜_̴̷̶̨̡̧̡̨̛̛̮̤̰͔̖̗̖͈̟̜̹̠͇̹̘͈̦͎͇̫͍̘͎̰̪̗͙̭͚̮͖̩͉̝̹̦̃ͭ͛ͧ̅͗ͨ̔̑̀̀̊ͣ͗ͦ̔̆͋̋͛̾̈́̐ͩͪͯ̾̒̈̿͆͒͒̿ͬ̚͜͢͢͢͠͞͡ͅ_̯̤̙̣̼̫̙̺̲̓̾̑̀͑̉͒ͦ̕͡_̴̷̸̴̸̶̵̸̵̴̢̡̧̡̡̨̨̧̧̛̩̦̣̖͍͎͕̙̰̟͍̭̟͙̬̲̪͉̬̻̭̪̘̠̹̻͔̬͓͖̹̹̣͇̥͔͍̹̦̠̩̹̭͖͉̬͇̩̼͖͈̮̰̠̘̭̙͙̖̩̠̜̠̬̜͎͇͖̖̳̤̝̟͖͉̬̯̖̭̰͎̖̲͚̥̙̳̟̼̔̐̆̋̀ͨͥ̔ͤ͒̑ͧ̋̆̎ͣͥ͑ͦͦ̈͊̃̔ͧ͗̓́ͬͦ͆̄̔̈́͋͌̋͐́͛̄͒͐̃̋̔̈͆̎̾́͗͂̃ͭ̓̉̓ͪ͐ͭ͒͒̀̐̎ͫ̾̑̎̒͌̄̈́ͪͧ̏͌̋̇͊ͪ͂̇ͭͦ̀ͦ̈͗̍͗ͦͯͫ̈́̀ͮ͌ͩ̓̎ͬ̋͗̚͘͘̕̕͘̚̚͘͘͢͢͜͜͜͜͜͢͠͞͡͡͞͝͠͝͝͝ͅͅ_̡̡͈̟̤̭̱͚̠͎͕̟̻͇̠̝̜̯̅ͪͤ̾̄̿̂ͩͮ͐̇͆̒ͫ̃̑͆̒ͣ͛̆̋̃͛ͬͥͬ͛ͦ̍̅ͪ̓̉̚̕͜͝_̷̸̵̡̫̲̭̺͖̭̜̺̼̯͚̣̹͕̲͒ͩ͒ͫ͊ͨ͆ͣ̄̌̉̔ͨ̕͞ш̷̶̵̵̶̸̴̧̧̛̥̜̙̯̥̝̥̼͔͎̳̖̳͖̗͉͓̠̺͈̮̱̺̦̘̯̺̑ͥ̽ͫ̊ͣ̆̽͛̃́̈́́ͧͯ͆̊̽̃́ͤ̍͑ͩ̿̒ͯ͂ͪ̚͜͜͢͡͝_̶̶̵̴̵̴̵̴̧̧̧̢̢̨̢̨̡͖͖̦̖͔͙͉̲̺̜̻̼̦̜̪̹̫̳͖̣̜̩͍̼͖̘̳̤͎̺͚͖̱̜̹̹̪̮͎̹̰̣̺̝̻̰͖̻͚̳̰̠ͮ̍ͩͩ̈̃ͨ͐̀́ͦͣ̿̓̇̄ͫͧ͆̋̔̀ͤͮͥͣ͑ͭͨͬͫ̑̂̈̀ͮ̽ͣ́ͦ̓̋͛ͧ̔̊̃̒̒̈́̅ͩͬ̄̿͂͆͑̓̾͗̽̄͂̔̋̀̒̏̎ͯͦͧ̀̑͆̅ͤ̅́ͣ̑̐̾̑͘͢͢͟͟͢͡͝͞ͅͅ_̵̴̴̶̧̨̛̦̯̱̩͕̦̦͓̩͖͍̰̩̣͙͎̗̗͔̻̮̭̮̹̥̫̝͋̆͂ͫ̿̊̂̃ͤ́̀̾͐ͥ̅̀ͧ̃͗͛͌ͨͤͥ̏͗̓̄̌ͧ̿̚͘̕̚̕̚͞͞͡ͅь̹̞̹̰͑_̶̴̖͉̳̘͖̭̜̯̪͖͂̆ͥͭ̎ͩͤ͆͆͌ͧ̀̅̓́̏͢͜_̷̴̸̶̶̴̸̨̡̨̡̡̨̡̧̧̡̨̧̨̛̛̙͚̩̩̰̬̱̩͚̩̤̤͓̲̖̤͓̣͍̪͇̬̰͇̺̼̟̣̳̰͍̝͙̗̗̖̘̣͕̬̲̺̣̱͈͈̩̦̞̦̮̩̻̪̳̬͙̩̬̬̮̹̮̬̖̲̱̖͙̩̼̟ͪ̈̀̅ͭͨ̆̎͛ͯ̔ͧ̊̆ͪ̌͆ͧ͒̊ͮ̋̀ͮ́͆͑ͤ͑̌ͨͤ̍͛̑ͩ̌ͭͫ͂͐̄͑̈́̆̏̾̅́̍ͮ̆̽͐̓̎̋͌̄̓̇͌̎̓̒ͤ͑̎̈́́̉ͨ̊͂ͩ̋͗ͩ͗ͭ̉́ͯ̅̉͆̕̕̕͢͢͟͜͟͝͞͠͝͞͝͝ͅ in /home/timur/dev/uni/web/app/controllers/study.php:27
            Stack trace:
            #0 /home/timur/dev/uni/web/app/core/router.php(95): App\Controllers\Study::check_test()
            #1 /home/timur/dev/uni/web/index.php(28): App\Core\Router->dispatch()
            #2 {main}
            thrown in /home/timur/dev/uni/web/app/controllers/study.php on line 27.
            Получено {$this->user_answers['hard_one']}. Стоит подумать еще раз.
            TEXT
        ]);
    }
}
